In [1]:
import pandas as pd

In [3]:
items = {
    'Alice': pd.Series(data=[10, 24, 23, 3], index=['eggs', 'milk', 'bananas', 'bread']),
    'Bob': pd.Series(data=[10, 2 , 3, 4], index=['watches', 'eggs', 'bananas', 'bikes'])
}

In [4]:
shopping_list = pd.DataFrame(items)
shopping_list

         Alice   Bob
bananas   23.0   3.0
bikes      NaN   4.0
bread      3.0   NaN
eggs      10.0   2.0
milk      24.0   NaN
watches    NaN  10.0

In [5]:
shopping_list.columns

Index(['Alice', 'Bob'], dtype='object')

In [6]:
shopping_list.index

Index(['bananas', 'bikes', 'bread', 'eggs', 'milk', 'watches'], dtype='object')

In [7]:
shopping_list.values

array([[23.,  3.],
       [nan,  4.],
       [ 3., nan],
       [10.,  2.],
       [24., nan],
       [nan, 10.]])

In [9]:
shopping_list.size

12

In [10]:
shopping_list.shape

(6, 2)

In [11]:
shopping_list.ndim

2

In [13]:
shopping_list[['Alice', 'Bob']]

         Alice   Bob
bananas   23.0   3.0
bikes      NaN   4.0
bread      3.0   NaN
eggs      10.0   2.0
milk      24.0   NaN
watches    NaN  10.0

In [22]:
shopping_list.loc[['bikes', 'eggs']]

       Alice  Bob
bikes    NaN  4.0
eggs    10.0  2.0

In [29]:
shopping_list > 10

         Alice    Bob
bananas   True  False
bikes    False  False
bread    False  False
eggs     False  False
milk      True  False
watches  False  False

In [31]:
bob_list = pd.DataFrame(items, columns=['Bob'])
bob_list

         Bob
watches   10
eggs       2
bananas    3
bikes      4

In [32]:
bob_food_list = pd.DataFrame(items, columns=['Bob'], index=['eggs', 'bananas'])
bob_food_list

         Bob
eggs       2
bananas    3

In [37]:
foods = {'Alice': [10, 10, 3], 'Bob': [1, 2, 3]}

In [38]:
df = pd.DataFrame(foods)
df

   Alice  Bob
0     10    1
1     10    2
2      3    3

In [45]:
df = pd.DataFrame(foods, index=['bananas', 'bread', 'eggs'])
df

         Alice  Bob
bananas     10    1
bread       10    2
eggs         3    3

In [46]:
stores = [{'watches': 2, 'bananas': 10, 'bike': 4}, {'eggs': 20, 'bananas': 2, 'bike': 10, 'milk': 20}]

In [49]:
df = pd.DataFrame(stores, index=['Walmart', 'Target'])
df

         watches  bananas  bike  eggs  milk
Walmart      2.0       10     4   NaN   NaN
Target       NaN        2    10  20.0  20.0

In [53]:
df['watches']['Target']

nan

In [55]:
df.loc[['Walmart']]

         watches  bananas  bike  eggs  milk
Walmart      2.0       10     4   NaN   NaN